In [3]:
import numpy as np

In [5]:
import pandas as pd

In [7]:
myindex = ['USA', 'Canada', 'Mexico']

In [8]:
mydata = [1776, 1867, 1821]

In [12]:
myser = pd.Series(data=mydata, index=myindex)

In [17]:
myser

USA       1776
Canada    1867
Mexico    1821
dtype: int64

In [18]:
ages = {'Sam': 5, "Frank": 10, "Spike": 7}

In [19]:
pd.Series(ages) #when ages is a dictionary

Sam       5
Frank    10
Spike     7
dtype: int64

In [21]:
q1 = {'Japan': 80, 'China': 450, 'India': 200, 'USA': 250}
q2 = {'Brazil': 100, 'China': 500, 'India': 210, 'USA': 260}

In [23]:
sales_q1 = pd.Series(q1)
sales_q2 = pd.Series(q2)

In [29]:
sales_q1.keys()

Index(['Japan', 'China', 'India', 'USA'], dtype='object')

In [31]:
sales_q1 * 2 
#this works as pandas Series is built off np

Japan    160
China    900
India    400
USA      500
dtype: int64

In [33]:
sales_q1 + sales_q2 
# when data not present in both, returns NaN

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

In [38]:
first_half = sales_q1.add(sales_q2, fill_value=0)
first_half
# uses fill_value when data not present

Brazil    100.0
China     950.0
India     410.0
Japan      80.0
USA       510.0
dtype: float64

In [42]:
pd.Series(first_half, dtype='int64')
#typecasting the data back to 64bit integer

Brazil    100
China     950
India     410
Japan      80
USA       510
dtype: int64

In [47]:
np.random.seed(101)
mydata = np.random.randint(0, 101, (4,3))

In [48]:
mydata

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [49]:
myindex = ['CA', 'NY', 'AZ', 'TX']

In [51]:
mycolumns = ['Jan', 'Feb', 'Mar']

In [57]:
df = pd.DataFrame(mydata, myindex, mycolumns)

In [61]:
df

    Jan  Feb  Mar
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, CA to TX
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Jan     4 non-null      int32
 1   Feb     4 non-null      int32
 2   Mar     4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes

In [65]:
#where is my code located??
%pwd

'C:\\Users\\Indrayudh\\Documents\\MLcourse'

In [66]:
%ls

 Volume in drive C is OS
 Volume Serial Number is 0CD6-4097

 Directory of C:\Users\Indrayudh\Documents\MLcourse

10/06/2022  07:26 PM    <DIR>          .
10/03/2022  06:11 PM    <DIR>          ..
10/06/2022  06:46 PM    <DIR>          .ipynb_checkpoints
10/03/2022  06:11 PM             1,093 LICENSE
10/03/2022  11:33 PM            33,561 numpySection.ipynb
10/06/2022  07:26 PM            10,123 pandas.ipynb
10/03/2022  07:58 PM            18,068 PythonCrashCourse.ipynb
10/03/2022  06:11 PM                95 README.md
               5 File(s)         62,940 bytes
               3 Dir(s)  194,952,261,632 bytes free

In [74]:
df = pd.read_csv('C:\\Users\\Indrayudh\\Documents\\MLcourse\\CourseContent\\03-Pandas\\tips.csv')

SyntaxError: invalid syntax (3717847192.py, line 1)

In [69]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672